// FAQ populate and search
const faqData = [
  // BASICS
  { id: 1, category: "Basics", question: "What is a WhatsApp bot and how does it work?", answer: "A WhatsApp bot is an automated program that interacts with users on WhatsApp, answering queries, sending updates, and performing tasks without manual input." },
  { id: 2, category: "Basics", question: "Can I use a WhatsApp bot for business growth?", answer: "Yes, WhatsApp bots help businesses with customer support, order processing, lead generation, and marketing automation." },
  { id: 3, category: "Basics", question: "Do I need a separate phone number for a WhatsApp bot?", answer: "Yes, typically a dedicated phone number is required to set up a WhatsApp bot for business or personal automation." },
  { id: 4, category: "Basics", question: "Are WhatsApp bots legal to use?", answer: "Yes, they are legal if you comply with WhatsApp Business API policies and avoid spammy behavior." },
  { id: 5, category: "Basics", question: "What is the difference between a WhatsApp bot and a chatbot?", answer: "A chatbot is a general automation tool for messaging apps, while a WhatsApp bot specifically works inside WhatsApp." },
  { id: 6, category: "Basics", question: "How can a WhatsApp bot help small businesses?", answer: "It helps small businesses by providing 24/7 customer support, automated responses, and efficient sales handling." },
  { id: 7, category: "Basics", question: "Do I need coding skills to create a WhatsApp bot?", answer: "No, you can use platforms with no-code solutions, but coding knowledge allows more customization." },
  { id: 8, category: "Basics", question: "What are the advantages of using WhatsApp bots?", answer: "Key benefits include instant replies, lead capture, customer support automation, and time savings." },

  // TECHNICAL
  { id: 9, category: "Technical", question: "How do I host a WhatsApp bot on a VPS?", answer: "You need to set up a server, install dependencies, deploy your bot code, and keep it running 24/7." },
  { id: 10, category: "Technical", question: "Which programming languages are best for building WhatsApp bots?", answer: "Popular options include JavaScript (Node.js), Python, PHP, and Java." },
  { id: 11, category: "Technical", question: "How do I connect my bot with the WhatsApp Business API?", answer: "You can apply for WhatsApp Business API access or use third-party providers that simplify integration." },
  { id: 12, category: "Technical", question: "What is a webhook in WhatsApp bots?", answer: "A webhook allows WhatsApp to send real-time messages and events from users to your bot’s server." },
  { id: 13, category: "Technical", question: "How do I secure my WhatsApp bot’s API keys?", answer: "Always use environment variables, encrypted storage, and restrict access to your keys." },
  { id: 14, category: "Technical", question: "How do I scale a WhatsApp bot for thousands of users?", answer: "Use load balancing, database optimization, and cloud hosting to handle high traffic." },
  { id: 15, category: "Technical", question: "Can I integrate my WhatsApp bot with databases?", answer: "Yes, databases like MySQL, MongoDB, or Firebase can store user data and chat history." },
  { id: 16, category: "Technical", question: "Can I integrate WhatsApp bots with payment systems?", answer: "Yes, bots can connect to Paystack, Stripe, or PayPal to handle payments via links." },

  // PHONES
  { id: 17, category: "Phones", question: "Can I run a WhatsApp bot on my phone?", answer: "Yes, but it is limited. For long-term use, VPS or cloud hosting is recommended." },
  { id: 18, category: "Phones", question: "Do WhatsApp bots drain battery on mobile?", answer: "Yes, if run directly on a phone, but VPS/cloud bots avoid this issue." },
  { id: 19, category: "Phones", question: "How do I test a WhatsApp bot on Android?", answer: "Install dependencies (Node.js/Python), run your script, and connect via WhatsApp Web or API." },
  { id: 20, category: "Phones", question: "Do iPhone bots work the same as Android bots?", answer: "Yes, the bot logic runs on servers, so device type does not matter." },
  { id: 21, category: "Phones", question: "How do bots handle media messages like images and videos?", answer: "Bots can be programmed to send, receive, and process media files via WhatsApp Business API." },
  { id: 22, category: "Phones", question: "Can I use multiple WhatsApp bots on one phone?", answer: "Not directly. Each bot requires its own number or account." },

  // COMPUTERS
  { id: 23, category: "Computers", question: "How do I run a WhatsApp bot locally on PC?", answer: "You install Node.js or Python, run the bot script, and keep it connected to WhatsApp Web or API." },
  { id: 24, category: "Computers", question: "What are the system requirements to run a WhatsApp bot?", answer: "A PC with at least 2GB RAM, stable internet, and Node.js/Python installed is enough for small bots." },
  { id: 25, category: "Computers", question: "Can I run a WhatsApp bot without internet?", answer: "No, bots need constant internet to send and receive messages." },
  { id: 26, category: "Computers", question: "How do I make my WhatsApp bot run 24/7?", answer: "Use VPS hosting or cloud servers to keep your bot active nonstop." },
  { id: 27, category: "Computers", question: "Can I run a WhatsApp bot inside Docker?", answer: "Yes, Docker helps containerize bots for easier deployment and scaling." },
  { id: 28, category: "Computers", question: "Can I run multiple bots on the same computer?", answer: "Yes, with separate processes or Docker containers, you can run multiple bots." },

  // BUSINESS
  { id: 29, category: "Business", question: "How can WhatsApp bots help e-commerce stores?", answer: "They automate order confirmations, product recommendations, and shipping updates." },
  { id: 30, category: "Business", question: "Can WhatsApp bots collect customer feedback?", answer: "Yes, they can send surveys, polls, and feedback forms automatically." },
  { id: 31, category: "Business", question: "How do WhatsApp bots help with lead generation?", answer: "They capture user details, qualify leads, and send automated follow-ups." },
  { id: 32, category: "Business", question: "Can I integrate my WhatsApp bot with CRM systems?", answer: "Yes, CRMs like HubSpot, Zoho, or Salesforce can integrate with WhatsApp bots." },
  { id: 33, category: "Business", question: "Are WhatsApp bots good for customer service?", answer: "Yes, they provide instant replies, 24/7 support, and reduce response times." },
  { id: 34, category: "Business", question: "Can WhatsApp bots handle appointment bookings?", answer: "Yes, they can schedule appointments, send reminders, and confirm bookings." },
  { id: 35, category: "Business", question: "Can WhatsApp bots improve sales conversions?", answer: "Yes, automated responses and personalized offers increase conversion rates." },

  // SECURITY
  { id: 36, category: "Security", question: "Are WhatsApp bots safe to use?", answer: "Yes, if built securely and following WhatsApp’s official guidelines." },
  { id: 37, category: "Security", question: "How do I protect my WhatsApp bot from hackers?", answer: "Use strong authentication, encrypted connections, and API key protection." },
  { id: 38, category: "Security", question: "Can WhatsApp bots be blocked by WhatsApp?", answer: "Yes, if they violate policies, send spam, or misuse user data." },
  { id: 39, category: "Security", question: "Do WhatsApp bots store personal data?", answer: "They can, but developers should comply with GDPR and privacy laws." },
  { id: 40, category: "Security", question: "Can users opt-out of WhatsApp bot messages?", answer: "Yes, bots should include an opt-out option to respect user preferences." },
  { id: 41, category: "Security", question: "Do WhatsApp bots use end-to-end encryption?", answer: "Messages between users are encrypted, but server-side storage depends on your setup." },
  { id: 42, category: "Security", question: "How do I prevent spam with WhatsApp bots?", answer: "Send only useful messages, follow API limits, and avoid bulk spamming." },

  // EXTRA SEO QUESTIONS
  { id: 43, category: "SEO", question: "How do WhatsApp bots help digital marketing?", answer: "They improve engagement, retarget leads, and deliver promotions instantly." },
  { id: 44, category: "SEO", question: "Can WhatsApp bots be used for affiliate marketing?", answer: "Yes, they can share affiliate links, promotions, and track user clicks." },
  { id: 45, category: "SEO", question: "Do WhatsApp bots improve SEO indirectly?", answer: "Yes, by improving engagement, reducing bounce rates, and increasing traffic." },
  { id: 46, category: "SEO", question: "Can WhatsApp bots replace email marketing?", answer: "They don’t replace emails but provide faster and more engaging communication." },
  { id: 47, category: "SEO", question: "How can WhatsApp bots help social media growth?", answer: "They can auto-reply to inquiries, share content, and boost engagement." },
  { id: 48, category: "SEO", question: "Can WhatsApp bots drive traffic to websites?", answer: "Yes, they can share links, updates, and encourage users to visit your site." },
  { id: 49, category: "SEO", question: "Are WhatsApp bots good for influencer marketing?", answer: "Yes, influencers use them to broadcast updates, promotions, and product launches." },
  { id: 50, category: "SEO", question: "How can I use WhatsApp bots for brand awareness?", answer: "Consistent automation, personalized messages, and instant replies strengthen brand presence." }
];
